# EDA216 - Lecture 1

During the lectures and exercises we'll try out SQL-code in Jupyter
Notebooks, and to do that we begin by evaluating:

In [1]:
%load_ext sql

In [16]:
%sql sqlite:////home/wlmr/code/datbas/nobel.db

'Connected: @/home/wlmr/code/datbas/nobel.db'

Everything in the code sections is evaluated
as [Python](https://www.python.org/) code (more on that later), but
lines beginning with `%sql` will be seen as an SQL statement, and all
lines following `%%sql` will also be evaluated as SQL statements.

## Contacts

We first define a table to store our contacts:

In [5]:
%%sql
DROP TABLE IF exists contacts;
CREATE TABLE contacts (
  name             VARCHAR(32),
  phone            VARCHAR(16),
  email            VARCHAR(32)
);

INSERT INTO contacts (name, phone, email)
VALUES ('Adam', '650-043-1797', 'adam@life.edu'),
       ('Emma', '347-326-4813', 'emma@mail.org'),
       ('Christian', '347-326-3154', 'cs@gmail.com');

   sqlite://
 * sqlite:////home/wlmr/code/datbas/nobel.db
Done.
Done.
3 rows affected.

[]

We can see everything that's in the table using:

In [6]:
%%sql
SELECT * FROM contacts;

   sqlite://
 * sqlite:////home/wlmr/code/datbas/nobel.db
Done.

[('Adam', '650-043-1797', 'adam@life.edu'),
 ('Emma', '347-326-4813', 'emma@mail.org'),
 ('Christian', '347-326-3154', 'cs@gmail.com')]

### Exercises

Write SQL statements to do the following:

+  Show all names

In [8]:
%%sql
SELECT name
FROM contacts

   sqlite://
 * sqlite:////home/wlmr/code/datbas/nobel.db
Done.

[('Adam',), ('Emma',), ('Christian',)]

Chosing just a few columns is called a *projection*.

+  Show all names, alphabetically

In [9]:
%%sql
SELECT name
FROM contacts
ORDER BY name

   sqlite://
 * sqlite:////home/wlmr/code/datbas/nobel.db
Done.

[('Adam',), ('Christian',), ('Emma',)]

+  Show all phone numbers

In [10]:
%%sql
SELECT phone
FROM contacts

   sqlite://
 * sqlite:////home/wlmr/code/datbas/nobel.db
Done.

[('650-043-1797',), ('347-326-4813',), ('347-326-3154',)]

+  Show Adam's phone number and email address

In [11]:
%%sql
SELECT phone, email
FROM contacts
WHERE name like 'Adam'

   sqlite://
 * sqlite:////home/wlmr/code/datbas/nobel.db
Done.

[('650-043-1797', 'adam@life.edu')]

Chosing just a few rows is called a *selection*.

+  Show all phone numbers beginning with `347`

In [12]:
%%sql
SELECT phone
FROM contacts
WHERE phone like '347%'

   sqlite://
 * sqlite:////home/wlmr/code/datbas/nobel.db
Done.

[('347-326-4813',), ('347-326-3154',)]

## Nobel laureates in literature

In [13]:
%sql sqlite:///nobel.db

'Connected: @nobel.db'

To see the structure of a table, we can write:

In [17]:
%sql PRAGMA table_info(laureates);

   sqlite://
 * sqlite:////home/wlmr/code/datbas/nobel.db
   sqlite:///nobel.db
Done.

[(0, 'year', 'INTEGER', 0, None, 0),
 (1, 'name', 'TEXT', 0, None, 0),
 (2, 'nationality', 'TEXT', 0, None, 0),
 (3, 'language', 'TEXT', 0, None, 0),
 (4, 'citation', 'TEXT', 0, None, 0),
 (5, 'genres', 'TEXT', 0, None, 0)]

We can also get a SQL statement which creates the table in question:

In [15]:
%sql SELECT sql FROM sqlite_master WHERE name = <table name>;

   sqlite://
   sqlite:////home/wlmr/code/datbas/nobel.db
 * sqlite:///nobel.db
(sqlite3.OperationalError) near "<": syntax error [SQL: 'SELECT sql FROM sqlite_master WHERE name = <table name>;'] (Background on this error at: http://sqlalche.me/e/e3q8)

This can sometimes be useful, I've put it here for reference.


### Exercises

+  Show the names of all the laureates

In [18]:
%%sql
SELECT *
FROM nobel

   sqlite://
 * sqlite:////home/wlmr/code/datbas/nobel.db
   sqlite:///nobel.db
(sqlite3.OperationalError) no such table: nobel [SQL: 'SELECT *\nFROM nobel'] (Background on this error at: http://sqlalche.me/e/e3q8)

+  When did Winston Churchill win his prize?

In [ ]:
%%sql

+ Why did Bob Dylan get the prize?

In [ ]:
%%sql

+  How many prizes has been awarded?

In [ ]:
%%sql

+  How many prizes have been won by Swedish authors after 1920?

In [ ]:
%%sql

Now return to the slides...


## More tables for our contacts

In [ ]:
%%sql
DROP TABLE IF exists contacts;
CREATE TABLE contacts (
  id               INT PRIMARY KEY,
  name             VARCHAR(32) NOT NULL
);

DROP TABLE IF exists phone_numbers;
CREATE TABLE phone_numbers (
  id               INT REFERENCES contacts(id),
  phone            VARCHAR(16)
);

DROP TABLE IF exists email_addresses;
CREATE TABLE email_addresses (
  id               INT REFERENCES contacts(id),
  email            VARCHAR(32)
);

INSERT INTO contacts (id, name)
VALUES (101, 'Adam'),
       (102, 'Emma'),
       (103, 'Christian');

INSERT INTO phone_numbers (id, phone)
VALUES (102, '347-326-4813'),
       (103, '347-326-3154');

INSERT INTO email_addresses (id, email)
VALUES (101, 'adam@life.edu'),
       (102, 'emma@mail.org'),
       (103, 'cs@gmail.com'),
       (103, 'cso@work.com');

Write SQL statements to do the following:

+ Show all names

In [ ]:
%%sql

+ Show Emma's phone number

In [ ]:
%%sql

+ Show Christian's email addresses

In [ ]:
%%sql

+ Show the name and email address of everyone with a phone number beginning
  with `347`

In [ ]:
%%sql

+ Show the name and phone number of everyone with an email ending with
  `.com`

In [ ]:
%%sql